name: "imagenet-classifier"
platform: "pytorch_libtorch"
max_batch_size: 1

input [
    {
        name: "input__0"
        data_type: TYPE_FP32
        format: FORMAT_NCHW
        dims: [ 3, 224, 224 ]
    }
]

output [
    {
        name: "output__0"
        data_type: TYPE_FP32
        dims: [ 1000 ]
    }
]

parameters: {
    key: "INFERENCE_MODE"
    value: { string_value: "true" }
}
